IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/AM263/LIN2_LIN2.xml
	<register id="LIN2_SCIFLR" acronym="LIN2_SCIFLR" offset="0x1C" width="32" description="The SCIFLR register indicates the current status of the various interrupt sources of the LIN module.">
		<bitfield id="BE" width="1" begin="31" end="31" resetval="0x0" description="Bit Error Flag.This bit is effective in LIN mode only. This bit is set when there has been a bit error. This is detected by the bit monitor in the internal bit monitor. This bit is cleared by:- Reading the corresponding interrupt offset in the SCIINTVECT0/1 register- Setting the SWnRESET bit [SCIGCR1.7]- RESET bit [SCIGCR0.0]- System reset- Writing a 1 to this bit- Reception of a new sync break This field is writable in LIN mode only." range="31" rwaccess="R/W1TC"/> 
		<bitfield id="PBE" width="1" begin="30" end="30" resetval="0x0" description="Physical Bus Error Flag.This bit is effective in LIN mode only. This bit is set when there has been a physical bus error. This is detected by the bit monitor in TED. This bit is cleared by:- Reading the corresponding interrupt offset in the SCIINTVECT0/1 register- Setting the SWnRESET bit [SCIGCR1.7]- RESET bit [SCIGCR0.0]- System reset- Writing a 1 to this bit- Reception of a new sync break Note: thie PBE will ony be flagged if no sync break can be generated. [because of a bus shortage to VBAT] or if no sync break delimeter can be generated [because of a bus shortage to GND]. This field is writable in LIN mode only." range="30" rwaccess="R/W1TC"/> 
		<bitfield id="CE" width="1" begin="29" end="29" resetval="0x0" description="Checksum Error Flag. This bit is effective in LIN mode only. This bit is set when there is checksum error detected by a receiving node. The type of checksum to be used depends on the SCIGCR1.CTYPE bit. This bit is cleared by:- Reading the corresponding interrupt offset in the SCIINTVECT0/1 register- Setting the SWnRESET bit [SCIGCR1.7]- RESET bit [SCIGCR0.0]- System reset- Writing a 1 to this bit- Reception of a new sync break This field is writable in LIN mode only." range="29" rwaccess="R/W1TC"/> 
		<bitfield id="ISFE" width="1" begin="28" end="28" resetval="0x0" description="Inconsistent Sync Field Error Flag.This bit is effective in LIN mode only. This bit is set when there has been an inconsistent Sync Field error detected by the synchronizer during header reception. See the Header Reception and Adaptive Baudrate section for more information.  This bit is cleared by:- Reading the corresponding interrupt offset in the SCIINTVECT0/1 register- Setting the SWnRESET bit [SCIGCR1.7]- RESET bit [SCIGCR0.0]- System reset- Writing a 1 to this bit- Reception of a new sync break This field is writable in LIN mode only." range="28" rwaccess="R/W1TC"/> 
		<bitfield id="NRE" width="1" begin="27" end="27" resetval="0x0" description="No-Response Error Flag.This bit is effective in LIN mode only. This bit is set when there is no response to a master's header completed within TFRAME_MAX. This timeout period is applied for message frames of unknown length [identifiers 0 to 61]. This error is detected by the synchronizer of the module. This bit is cleared by:- Reading the corresponding interrupt offset in the SCIINTVECT0/1 register- Setting the SWnRESET bit [SCIGCR1.7]- RESET bit [SCIGCR0.0]- System reset- Writing a 1 to this bit- Reception of a new sync break This field is writable in LIN mode only." range="27" rwaccess="R/W1TC"/> 
		<bitfield id="FE" width="1" begin="26" end="26" resetval="0x0" description="Framing error flag.This bit is effective in LIN or SCI-compatible mode. This bit is set when an expected stop bit is not found. In SCI compatible mode, only the first stop bit is checked. The missing stop bit indicates that synchronization with the start bit has been lost and that the character is incorrectly framed. Detection of a framing error causes the SCI to generate an error interrupt if the RXERR INT ENA bit is set. This bit is cleared by:- Reading the corresponding interrupt offset in the SCIINTVECT0/1 register- Setting the SWnRESET bit [SCIGCR1.7]- RESET bit [SCIGCR0.0]- System reset- Writing a 1 to this bit- Reception of a new character [SCI-compatible mode], or frame [LIN mode]In multibuffer mode the frame is defined in the SCIFORMAT register." range="26" rwaccess="R/W1TC"/> 
		<bitfield id="OE" width="1" begin="25" end="25" resetval="0x0" description="Overrun error flag.This bit is effective in LIN or SCI-compatible mode. This bit is set when the transfer of data from SCIRXSHF to SCIRD overwrites unread data already in SCIRD or the RDy buffers. Detection of an overrun error causes the LIN to generate an error interrupt if the SET OE INT bit is one. This bit is cleared by:- Reading the corresponding interrupt offset in the SCIINTVECT0/1 register- Setting the SWnRESET bit [SCIGCR1.7]- RESET bit [SCIGCR0.0]- System reset- Writing a 1 to this bit" range="25" rwaccess="R/W1TC"/> 
		<bitfield id="PE" width="1" begin="24" end="24" resetval="0x0" description="Parity error flag.This bit is effective in LIN or SCI-compatible mode. This bit is set when a parity error is detected in the received data. In SCI address-bit mode, the parity is calculated on the data and address bit fields of the received frame. In idle-line mode, only the data is used to calculate parity. An error is generated when a character is received with a mismatch between the number of 1s and its parity bit. For more information on parity checking, see the SCI Global Control Register [SCIGCR1] description. If the parity function is disabled [that is, SCIGCR1.2 = 0], the PE flag is disabled and read as 0. Detection of a parity error causes the LIN to generate an error interrupt if the SET PE INT bit = 1.  This bit is cleared by:- Reading the corresponding interrupt offset in the SCIINTVECT0/1 register- Setting the SWnRESET bit [SCIGCR1.7]- RESET bit [SCIGCR0.0]- System reset- Reception of a new charcter [SCI-compatible mode] or frame [LIN mode]- Writing a 1 to this bit" range="24" rwaccess="R/W1TC"/> 
		<bitfield id="IDRXFLAG" width="1" begin="14" end="14" resetval="0x0" description="Identifier On Receive Flag.This bit is effective in LIN mode only. This flag is set once an identifier is received with an RX match and no ID-parity error. See the Message Filtering and Validation section for more details. When this flag is set it indicates that a new valid identifier has been received on an RX match. This bit is cleared by:- Reading the corresponding interrupt offset in the SCIINTVECT0/1 register- Setting the SWnRESET bit [SCIGCR1.7]- RESET bit [SCIGCR0.0]- System reset- Reading the LINID register- Writing a 1 to this bit This field is writable in LIN mode only." range="14" rwaccess="R/W1TC"/> 
		<bitfield id="IDTXFLAG" width="1" begin="13" end="13" resetval="0x0" description="Identifier On Transmit Flag.This bit is effective in LIN mode only. This flag is set once an identifier is received with a TX match and no ID-parity error. See the Message Filtering and Validation section for more details. When this flag is set it indicates that a new valid identifier has been received on a TX match. This bit is cleared by: - Reading the corresponding interrupt offset in the SCIINTVECT0/1 register- RESET bit [SCIGCR0.0]- Setting SWnRESET- System reset- Reading the LINID register- Writing a 1 to this bit  This field is writable in LIN mode only." range="13" rwaccess="R/W1TC"/> 
		<bitfield id="RXWAKE" width="1" begin="12" end="12" resetval="0x0" description="Receiver wakeup detect flag.This bit is effective in SCI-compatible mode only. The SCI sets this bit to indicate that the data currently in SCIRD is an address. This bit is cleared by:- RESET bit- Setting the SWnRESET bit [SCIGCR1.7]- System reset- Receipt of a data frame This bit is writable in SCI mode only." range="12" rwaccess="R"/> 
		<bitfield id="TXEMPTY" width="1" begin="11" end="11" resetval="0x1" description="Transmitter Empty flag.The value of this flag indicates the contents of the transmitter's buffer register[s] [SCITD/TDy] and shift register [SCITXSHF]. In multibuffer mode, this flag indicates the value of the TDx registers and shift register [SCITXSHF]. In non multibuffer mode, this flag indicates the value of LINTD0 [byte] and shift register [SCITXSHF]. This bit is set by: - RESET bit [SCIGCR0.0]- Setting the SWnRESET bit [SCIGCR1.7]- System reset.  Note: This bit does not cause an interrupt request." range="11" rwaccess="R"/> 
		<bitfield id="TXWAKE" width="1" begin="10" end="10" resetval="0x0" description="SCI transmitter wakeup method select.This bit is effective in SCI-compatible mode only. The TXWAKE bit controls whether the data in SCITD should be sent as an address or data frame using multiprocessor communication format. This bit is set to 1 or 0 by software before a byte is written to SCITD and is cleared by the SCI when data is transferred from SCITD to SCITXSHF or by a system reset. TXWAKE is not cleared by the SWnRESET bit [SCIGCR1.7]." range="10" rwaccess="R/W"/> 
		<bitfield id="RXRDY" width="1" begin="9" end="9" resetval="0x0" description="Receiver ready flag. In SCI compatibility mode, the receiver sets this bit to indicate that the SCIRD contains new data and is ready to be read by the CPU. In LIN mode, RXRDY is set once a valid frame is received in multibuffer mode, a valid frame being a message frame received with no errors. In non multibuffer mode RXRDY is set for each received byte and will be set for the last byte of the frame if there are no errors. The SCI/LIN generates a receive interrupt when RXRDY flag bit is setif the interrupt-enable bit is set [SCISETINT.9]. RXRDY is cleared by:- RESET bit [SCIGCR0.0]- Setting the SWnRESET- System reset- Writing a 1 to this bit- Reading SCIRD in while in SCI compatibility mode- Reading last data byte RDy of the response in LIN mode  Note: The RXRDY flag cannot be cleared by reading the corresponding interrupt offset in the SCIINTVECT0/1 register." range="9" rwaccess="R/W1TC"/> 
		<bitfield id="TXRDY" width="1" begin="8" end="8" resetval="0x1" description="Transmitter buffer register ready flag.When set, this bit indicates that the transmit buffer[s] register [SCITD in compatibility mode and LINTD0, LINTD1 in MBUF mode] is/are ready to get another character from a CPU write. In SCI compatibility mode, writing data to SCITD automatically clears this bit. In LIN mode, this bit is cleared once byte 0 [TD0] is written to LINTD0. This bit is set after the data of the TX buffer are shifted into the SCITXSHF register. This event can trigger a transmit DMA event if the DMA enable bit is set. This bit is set to 1 by:- RESET bit [SCIGCR0.0]- Setting the SWnRESET [SCIGCR1.7]- System reset Note: The TXRDY flag cannot be cleared by reading the corresponding interrupt offset in the SCIINTVECT0/1 register. Note: The transmit interrupt request can be eliminated until the next series of data is written into the transmit buffers LINTD0 and LINTD1, by disaLINg the corresponding interrupt via the SCICLEARINT register or by disaLINg the transmitter via the TXENA bit [SCIGCR1.25=0]." range="8" rwaccess="R"/> 
		<bitfield id="TOA3WUS" width="1" begin="7" end="7" resetval="0x0" description="Timeout After 3 Wakeup Signals flag.This bit is effective in LIN mode only. This flag is set if there is no Sync Break received after 3 wakeup signals and a period of 1.5 seconds have passed. Such expiration time is used before issuing another round of wakeup signals. This bit is cleared by:- Reading the corresponding interrupt offset in the SCIINTVECT0/1 register- Setting the SWnRESET bit [SCIGCR1.7]- RESET bit [SCIGCR0.0]- System reset- Writing a 1 to this bit This field is writable in LIN mode only." range="7" rwaccess="R/W1TC"/> 
		<bitfield id="TOAWUS" width="1" begin="6" end="6" resetval="0x0" description="Timeout After Wakeup Signal flag.This bit is effective in LIN mode only. This bit is set if there is no Sync Break received after a wakeup signal has been sent. A minimum of 150 ms expiration time is used before issuing another wakeup signal.  This bit is cleared by:- Reading the corresponding interrupt offset in the SCIINTVECT0/1 register- Setting the SWnRESET bit [SCIGCR1.7]- RESET bit [SCIGCR0.0]- System reset- Writing a 1 to this bit This field is writable in LIN mode only." range="6" rwaccess="R/W1TC"/> 
		<bitfield id="TIMEOUT" width="1" begin="4" end="4" resetval="0x0" description="LIN Bus IDLE timeout flag.This bit is effective in LIN mode only. This bit is set if there is no LIN bus activity for at least 4 seconds. LIN bus activity being a transition from recessive to dominant. This bit is cleared by:- Reading the corresponding interrupt offset in the SCIINTVECT0/1 register- Setting the SWnRESET bit [SCIGCR1.7]- RESET bit [SCIGCR0.0]- System reset- Writing a 1 to this bit This field is writable in LIN mode only." range="4" rwaccess="R/W1TC"/> 
		<bitfield id="BUSY" width="1" begin="3" end="3" resetval="0x0" description="Bus BUSY flag.This bit is effective in LIN mode and SCI-compatible mode. This bit indicates whether the receiver is in the process of receiving a frame. As soon as the receiver detects the beginning of a start bit, the BUSY bit is set to 1. When the reception of a frame is complete, the BUSY bit is cleared. If SET WAKEUP INT is set and power down is requested while this bit is set, the SCI/LIN automatically prevents low-power mode from being entered and generates wakeup interrupt. The BUSY bit is controlled directly by the SCI receiver but can be cleared by:- Setting the SWnRESET bit [SCIGCR1.7]- RESET bit [SCIGCR0.0]- System reset." range="3" rwaccess="R"/> 
		<bitfield id="IDLE" width="1" begin="2" end="2" resetval="0x1" description="SCI receiver in idle state.This bit is effective in SCI-compatible mode only. While this bit is set, the SCI looks for an idle period to resynchronize itself with the bit stream. The receiver does not receive any data while the bit is set. The bus must be idle for 11 bit periods to clear this bit. The SCI enters this state:- After a system reset- Setting the SWnRESET bit [SCIGCR1.7]- After coming out of power down This bit is writable in SCI mode only." range="2" rwaccess="R"/> 
		<bitfield id="WAKEUP" width="1" begin="1" end="1" resetval="0x0" description="Wake-up flag.This bit is effective in LIN mode only. This bit is set by the SCI/LIN when receiver or transmitter activity has taken the module out of power-down mode. An interrupt is generated if the SET WAKEUP INT bit [SCISETINT.1] is set. This bit is cleared by:- Reading the corresponding interrupt offset in the SCIINTVECT0/1 register.- Setting the SWnRESET bit [SCIGCR1.7]- RESET bit [SCIGCR0.0]- System reset- Writing a 1 to this bit. This field is writable in LIN mode only." range="1" rwaccess="R/W1TC"/> 
		<bitfield id="BRKDT" width="1" begin="0" end="0" resetval="0x0" description="SCI break-detect flag.This bit is effective in SCI-compatible mode only. This bit is set when the SCI detects a break condition on the LINRX pin. A break condition occurs when the LINRX pin remains continuously low for at least 10 bits after a missing first stop bit, that is, after a framing error. Detection of a break condition causes the SCI to generate an error interrupt if the BRKDT INT ENA bit is set. The BRKDT bit is cleared by the following:- Reading the corresponding interrupt offset in the SCIINTVECT0/1 register.- Setting the SWnRESET bit [SCIGCR1.7]- RESET bit [SCIGCR0.0]- System reset- By writing a 1 to this bit. This bit is writable in SCI mode only." range="0" rwaccess="R/W1TC"/>
	</register>
	<register id="LIN2_SCIINTVECT0" acronym="LIN2_SCIINTVECT0" offset="0x20" width="32" description="The SCIINTVECT0 register indicates the offset for the INT0 interrupt line.">
		<bitfield id="INTVECT0" width="5" begin="4" end="0" resetval="0x0" description="Interrupt vector offset for INT0.This register indicates the offset for interrupt line INT0. A read to this register updates its value to the next highest priority pending interrupt in SCIFLR and clears the flag corresponding to the offset that was read. Note: The flags for the receive [SCIFLR.9] and the transmit [SCIFLR.8] interrupts cannot be cleared by reading the corresponding offset vector in this register [see detailed description in SCIFLR register]." range="4 - 0" rwaccess="R"/>
	</register>
	<register id="LIN2_SCIINTVECT1" acronym="LIN2_SCIINTVECT1" offset="0x24" width="32" description="The SCIINTVECT1 register indicates the offset for the INT1 interrupt line.">
		<bitfield id="INTVECT1" width="5" begin="4" end="0" resetval="0x0" description="Interrupt vector offset for INT1.This register indicates the offset for interrupt line INT1. A read to this register updates its value to the next highest priority pending interrupt in SCIFLR and clears the flag corresponding to the offset that was read. Note: The flags for the receive [SCIFLR.9] and the transmit [SCIFLR.8] interrupts cannot be cleared by reading the corresponding offset vector in this register [see detailed description in SCIFLR register]." range="4 - 0" rwaccess="R"/>
	</register>
	<register id="LIN2_SCIFORMAT" acronym="LIN2_SCIFORMAT" offset="0x28" width="32" description="The SCIFORMAT register is used to set up the character and frame lengths.">
		<bitfield id="LENGTH" width="3" begin="18" end="16" resetval="0x0" description="Frame length control bits.In LIN mode, these bits indicate the number of bytes in the response field from 1 to 8 bytes. In buffered SCI mode, these bits indicate the number of characters. When these bits are used to indicate LIN response length [SCIGCR1[0] = 1], then when there is an ID RX match, this value should be updated with the expected length of the response. In buffered SCI mode, these bits indicate the number of characters with SCIFORMAT[2:0] bits per character. i.e. these bits indicate the transmitter/receiver format for the number of characters: 1 to 8. There can be up to eight characters with eight bits each." range="18 - 16" rwaccess="R/W"/> 
		<bitfield id="CHAR" width="3" begin="2" end="0" resetval="0x0" description="Character length control bits.These bits are effective in SCI compatible mode only. These bits set the SCI character length from 1 to 8 bits. Note: In compatibility mode or buffered SCI mode, when data of fewer than eight bits in length is received, it is left justified in SCIRD/RDy and padded with trailing zeros. Data read from the SCIRD should be shifted by software to make the received data right justified. Note: Data written to the SCITD should be right justified but does not need to be padded with leading zeros. These bits are witable in SCI mode only." range="2 - 0" rwaccess="R/W"/>
	</register>
	<register id="LIN2_BRSR" acronym="LIN2_BRSR" offset="0x2C" width="32" description="The BRSR register is used to configure the baud rate of the LIN module.">
		<bitfield id="U" width="3" begin="30" end="28" resetval="0x0" description="Superfractional Divider Selection. [U]These bits are an additional fractional part for the baudrate specification. These bits allow a super fine tuning of the fractional baudrate with 7 more intermediate values for each of the M fractional divider values. See the Superfractional Divider section for more details." range="30 - 28" rwaccess="R/W"/> 
		<bitfield id="M" width="4" begin="27" end="24" resetval="0x0" description="SCI/LIN 4-bit Fractional Divider Selection. [M]These bits are effective in LIN or SCI asynchronous mode. These bits are used to select a baud rate for the SCI/LIN module, and they are a fractional part for the baud rate specification. The M divider allows fine-tuning of the baud rate over the P prescaler with 15 additional intermediate values for each of the P integer values." range="27 - 24" rwaccess="R/W"/> 
		<bitfield id="SCI_LIN_PSH" width="8" begin="23" end="16" resetval="0x0" description="PRESCALER P [High Bits].SCI/LIN 24-bit Integer Prescaler Selection.These bits are used to select a baudrate for the SCI/LIN module. These bits are effective in LIN mode and SCI compatible mode. The SCI/LIN has an internally generated serial clock determined by the LIN module input clock and the prescalers P and M in this register. The SCI/LIN uses the 24-bit integer prescaler P value to select 1 of over 16,700,000 available baud rates. The additional 4-bit fractional prescaler M refines the baudate selection." range="23 - 16" rwaccess="R/W"/> 
		<bitfield id="SCI_LIN_PSL" width="16" begin="15" end="0" resetval="0x0" description="PRESCALER P [Low Bits].SCI/LIN 24-bit Integer Prescaler Selection.These bits are used to select a baudrate for the SCI/LIN module. These bits are effective in LIN mode and SCI compatible mode. The SCI/LIN has an internally generated serial clock determined by the LIN module input clock and the prescalers P and M in this register. The SCI/LIN uses the 24-bit integer prescaler P value to select 1 of over 16,700,000 available baud rates. The additional 4-bit fractional prescaler M refines the baudate selection." range="15 - 0" rwaccess="R/W"/>
	</register>
	<register id="LIN2_SCIED" acronym="LIN2_SCIED" offset="0x30" width="32" description="The SCIED register is a duplicate copy of SCIRD register that has no affect on the RXRDY flag for use with an emulator.">
		<bitfield id="ED" width="8" begin="7" end="0" resetval="0x0" description="Receiver Emulation Data.This bit is effective in SCI-compatible mode only. Reading SCIED[7-0] does not clear the RXRDY flag. This register should be used only by an emulator that must continually read the data buffer without affecting the RXRDY flag." range="7 - 0" rwaccess="R"/>
	</register>
