IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/AM263/LIN2_LIN2.xml
	<register id="LIN2_SCIRD" acronym="LIN2_SCIRD" offset="0x34" width="32" description="The SCIRD register is where received data is stored and can be read from.">
		<bitfield id="RD" width="8" begin="7" end="0" resetval="0x0" description="Received Data.This bit is effective in SCI-compatible mode only. When a frame has been completely received, the data in the frame is transferred from the receiver shift register SCIRXSHF to this register. As this transfer occurs, the RXRDY flag is set and a receive interrupt is generated if RX INT ENA [SCISETINT0.9] is set. When the data is read from SCIRD, the RXRDY flag is automatically cleared. When the SCI receives data that is fewer than eight bits in length, it loads the data into this register in a left justified format padded with trailing zeros. Therefore, your software should perform a logical shift on the data by the correct number of positions to make it right justified." range="7 - 0" rwaccess="R"/>
	</register>
	<register id="LIN2_SCITD" acronym="LIN2_SCITD" offset="0x38" width="32" description="The SCITD register is where data to be transmitted is written to by application software.">
		<bitfield id="TD" width="8" begin="7" end="0" resetval="0x0" description="Transmit dataThis bit is effective in SCI-compatible mode only. Data to be transmitted is written to this register. The transfer of data from this register to the transmit shift register SCITXSHF sets the TXRDY flag [SCIFLR.23], which indicates that SCITD is ready to be loaded with another byte of data. Note: If TX INT ENA [SCISETINT.8] is set, this data transfer also causes an interrupt. Note: Data written to the SCIRD register that is fewer than eight bits long must be right justified, but it does not need to be padded with leading zeros. " range="7 - 0" rwaccess="R/W"/>
	</register>
	<register id="LIN2_SCIPIO0" acronym="LIN2_SCIPIO0" offset="0x3C" width="32" description="The SCIPIO0 register is used to enable the LINTX and LINRX pins.">
		<bitfield id="TXFUNC" width="1" begin="2" end="2" resetval="0x0" description="Transmit pin function.This bit is effective in LIN or SCI mode. This bit defines the function of LINTX pin." range="2" rwaccess="R/W"/> 
		<bitfield id="RXFUNC" width="1" begin="1" end="1" resetval="0x0" description="Receive pin function.This bit is effective in LIN or SCI mode. This bit defines the function of the LINRX pin." range="1" rwaccess="R/W"/>
	</register>
	<register id="LIN2_SCIPIO1" acronym="LIN2_SCIPIO1" offset="0x40" width="32" description="Pin control Register 1">
		<bitfield id="TXDIR" width="1" begin="2" end="2" resetval="0x0" description="Transmit pin direction.This bit is effective in LIN or SCI mode. This bit determines the data direction on the LINTX pin if it is configured with general-purpose I/O functionality [TX FUNC = 0]. 0: general purpose input pin. 1: general-purpose output pin" range="2" rwaccess="R/W"/> 
		<bitfield id="RXDIR" width="1" begin="1" end="1" resetval="0x0" description="Receive pin direction.This bit is effective in LIN or SCI mode. This bit determines the data direction on the LINRX pin if it is configured with general-purpose I/O functionality [RX FUNC = 0]. 0: general purpose input pin. 1: general-purpose output pin" range="1" rwaccess="R/W"/>
	</register>
	<register id="LIN2_SCIPIO2" acronym="LIN2_SCIPIO2" offset="0x44" width="32" description="The SCIPIO2 register indicates the current status of the LINTX and LINRX pins.">
		<bitfield id="TXIN" width="1" begin="2" end="2" resetval="0x0" description="Transmit data in.This bit is effective in LIN or SCI-compatible mode. This bit contains the current value on the LINTX pin." range="2" rwaccess="R"/> 
		<bitfield id="RXIN" width="1" begin="1" end="1" resetval="0x0" description="Receive data in.This bit is effective in LIN or SCI-compatible mode. This bit contains the current value on the LINRX pin." range="1" rwaccess="R"/>
	</register>
	<register id="LIN2_SCIPIO3" acronym="LIN2_SCIPIO3" offset="0x48" width="32" description="Pin control Register 3">
		<bitfield id="TXOUT" width="1" begin="2" end="2" resetval="0x0" description="Transmit pin out.This bit is effective in LIN or SCI mode. This pin specifies the logic to be output on pin LINTX." range="2" rwaccess="R/W"/> 
		<bitfield id="RXOUT" width="1" begin="1" end="1" resetval="0x0" description="Receive pin out.This bit is effective in LIN or SCI mode. This pin specifies the logic to be output on pin LINRX." range="1" rwaccess="R/W"/>
	</register>
	<register id="LIN2_SCIPIO4" acronym="LIN2_SCIPIO4" offset="0x4C" width="32" description="Pin control Register 4">
		<bitfield id="TXSET" width="1" begin="2" end="2" resetval="0x0" description="Transmit pin set.This bit is effective in LIN or SCI mode. This bit sets the logic to be output on pin LINTX." range="2" rwaccess="R/W1TS"/> 
		<bitfield id="RXSET" width="1" begin="1" end="1" resetval="0x0" description="Receive pin set.This bit is effective in LIN or SCI mode. This bit sets the logic to be output on pin LINRX." range="1" rwaccess="R/W1TS"/>
	</register>
	<register id="LIN2_SCIPIO5" acronym="LIN2_SCIPIO5" offset="0x50" width="32" description="Pin control Register 5">
		<bitfield id="TXCLR" width="1" begin="2" end="2" resetval="0x0" description="Transmit pin clear.This bit is effective in LIN or SCI mode. This bit clears the logic to be output on pin LINTX." range="2" rwaccess="R/W1TC"/> 
		<bitfield id="RXCLR" width="1" begin="1" end="1" resetval="0x0" description="Receive pin clear.This bit is effective in LIN or SCI mode. This bit clears the logic to be output on pin LINRX." range="1" rwaccess="R/W1TC"/>
	</register>
	<register id="LIN2_SCIPIO6" acronym="LIN2_SCIPIO6" offset="0x54" width="32" description="Pin control Register 6">
		<bitfield id="TXPDR" width="1" begin="2" end="2" resetval="0x0" description="Transmit pin open drain enable.This bit is effective in LIN or SCI mode. This bit enables open-drain capability in the output pin LINTX." range="2" rwaccess="R/W"/> 
		<bitfield id="RXPDR" width="1" begin="1" end="1" resetval="0x0" description="Receive pin open drain enable.This bit is effective in LIN or SCI mode. This bit enables open-drain capability in the output pin LINRX." range="1" rwaccess="R/W"/>
	</register>
