IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/AM263/LIN2_LIN2.xml
	<register id="LIN2_SCIPIO7" acronym="LIN2_SCIPIO7" offset="0x58" width="32" description="Pin control Register 7">
		<bitfield id="TXPD" width="1" begin="2" end="2" resetval="0x0" description="Transmit pin pull control disable.This bit is effective in LIN or SCI mode. This bit disables pull control capability on the input pin LINTX." range="2" rwaccess="R/W"/> 
		<bitfield id="RXPD" width="1" begin="1" end="1" resetval="0x0" description="Receive pin pull control disable.This bit is effective in LIN or SCI mode. This bit disables pull control capability on the input pin LINRX." range="1" rwaccess="R/W"/>
	</register>
	<register id="LIN2_SCIPIO8" acronym="LIN2_SCIPIO8" offset="0x5C" width="32" description="Pin control Register 8">
		<bitfield id="TXPSL" width="1" begin="2" end="2" resetval="0x1" description="TX pin pull select.This bit is effective in LIN or SCI mode. This bit selects pull type in the input pin LINTX." range="2" rwaccess="R/W"/> 
		<bitfield id="RXPSL" width="1" begin="1" end="1" resetval="0x1" description="RX pin pull select.This bit is effective in LIN or SCI mode. This bit selects pull type in the input pin LINRX." range="1" rwaccess="R/W"/>
	</register>
	<register id="LIN2_LINCOMP" acronym="LIN2_LINCOMP" offset="0x60" width="32" description="The LINCOMPARE register is used to configure the sync delimeter and sync break extension.">
		<bitfield id="SDEL" width="2" begin="9" end="8" resetval="0x0" description="2-bit Sync Delimiter compare.These bits are effective in LIN mode only. These bits are used to configure the number of Tbit for the sync delimiter in the sync field.The time delay calculation for the synchronization delimiter is:TSDEL = [SDEL + 1]Tbit These bits are writable in LIN mode only." range="9 - 8" rwaccess="R/W"/> 
		<bitfield id="SBREAK" width="3" begin="2" end="0" resetval="0x0" description="3-bit Sync Break extend.LIN mode only. These bits are used to configure the number of Tbits for the sync break to extend the minimum 13 Tbit in the Sync Field to a maximum of 20 Tbit.The time delay calculation for the sync break is:TSYNBRK = 13Tbit + SBREAK x Tbit These bits are writable in LIN mode only." range="2 - 0" rwaccess="R/W"/>
	</register>
	<register id="LIN2_LINRD0" acronym="LIN2_LINRD0" offset="0x64" width="32" description="The LINRD0 register contains the lower 4 bytes of the received LIN frame data.">
		<bitfield id="RD0" width="8" begin="31" end="24" resetval="0x0" description="8-bit Receive Buffer 0Each response data-byte that is received in the SCIRXSHFT register is transferred to the corresponding RDy register according to the number of bytes received.A read of this byte clears the RXDY byte.Note: RD&#38;#60;x-1> is equivalent to Data byte &#38;#60;x> of the LIN frame." range="31 - 24" rwaccess="R"/> 
		<bitfield id="RD1" width="8" begin="23" end="16" resetval="0x0" description="8-bit Receive Buffer 1.Each response data-byte that is received in the SCIRXSHFT register is transferred to the corresponding RDy register according to the number of bytes received." range="23 - 16" rwaccess="R"/> 
		<bitfield id="RD2" width="8" begin="15" end="8" resetval="0x0" description="8-bit Receive Buffer 2.Each response data-byte that is received in the SCIRXSHFT register is transferred to the corresponding RDy register according to the number of bytes received." range="15 - 8" rwaccess="R"/> 
		<bitfield id="RD3" width="8" begin="7" end="0" resetval="0x0" description="8-bit Receive Buffer 3.Each response data-byte that is received in the SCIRXSHFT register is transferred to the corresponding RDy register according to the number of bytes received." range="7 - 0" rwaccess="R"/>
	</register>
	<register id="LIN2_LINRD1" acronym="LIN2_LINRD1" offset="0x68" width="32" description="The LINRD1 regsiter contains the upper 4 bytes of the received LIN frame data.">
		<bitfield id="RD4" width="8" begin="31" end="24" resetval="0x0" description="8-bit Receive Buffer 4 Each response data-byte that is received in the SCIRXSHFT register is transferred to the corresponding RDy register according to the number of bytes received." range="31 - 24" rwaccess="R"/> 
		<bitfield id="RD5" width="8" begin="23" end="16" resetval="0x0" description="8-bit Receive Buffer 5.Each response data-byte that is received in the SCIRXSHFT register is transferred to the corresponding RDy register according to the number of bytes received." range="23 - 16" rwaccess="R"/> 
		<bitfield id="RD6" width="8" begin="15" end="8" resetval="0x0" description="8-bit Receive Buffer 6.Each response data-byte that is received in the SCIRXSHFT register is transferred to the corresponding RDy register according to the number of bytes received." range="15 - 8" rwaccess="R"/> 
		<bitfield id="RD7" width="8" begin="7" end="0" resetval="0x0" description="8-bit Receive Buffer 7.Each response data-byte that is received in the SCIRXSHFT register is transferred to the corresponding RDy register according to the number of bytes received." range="7 - 0" rwaccess="R"/>
	</register>
	<register id="LIN2_LINMASK" acronym="LIN2_LINMASK" offset="0x6C" width="32" description="The LINMASK register is used to configure the masks used for filtering incoming ID messages for receive and transmit frames.">
		<bitfield id="RXIDMASK" width="8" begin="23" end="16" resetval="0x0" description="Receive ID mask.This field is effective in LIN mode only.This 8-bit mask is used for filtering an incoming ID message and compare it to the ID-byte. A compare match of the received ID witht the RX ID mask will set the ID RX flag and trigger and ID interrupt if enabled. A 0 bit in the mask indicates that bit is compared to the ID-byte. A 1 bit in the mask indicates that that bit is filtered and therefore not used in the compare. When HGENCTRL is set to 1, this field must be set to 0xFF." range="23 - 16" rwaccess="R/W"/> 
		<bitfield id="TXIDMASK" width="8" begin="7" end="0" resetval="0x0" description="Transmit ID mask.This field is effective in LIN mode only. This 8-bit mask is used for filtering an incoming ID message and compare it to the ID-byte. A compare match of the received ID with the TX ID Mask will set the ID TX flag and trigger an ID interrupt if enabled. A 0 bit in the mask indicates that bit is compared to the ID-byte. A 1 bit in the mask indicates that bit is filtered and therefore not used for the compare. When HGENCTRL is set to 1, this field must be set to 0xFF." range="7 - 0" rwaccess="R/W"/>
	</register>
	<register id="LIN2_LINID" acronym="LIN2_LINID" offset="0x70" width="32" description="The LINID register contains the identification fields for LIN communication.[[br]]NOTE: For software compatibility with future LIN modules, the HGEN CTRL bit must be set to 1, the RX ID MASK field must be set to FFh, and the TX ID MASK field must be set to FFh.">
		<bitfield id="RECEIVEDID" width="8" begin="23" end="16" resetval="0x0" description="Received ID.This bit is effective in LIN mode only. This byte contains the current message identifier. During header reception the received ID is copied from the SCIRXSHF register to this byte if there is no ID-parity error and there has been an RX/TX match.Note: If a framing error [FE] is detected during ID reception, the received ID will also not be copied to the LINID register." range="23 - 16" rwaccess="R"/> 
		<bitfield id="IDSLAVETASKBYTE" width="8" begin="15" end="8" resetval="0x0" description="ID Slave Task byte.This field is effective in LIN mode only. This byte contains the identifier to which the received ID of an incoming header will be compared in order to decide whether a RX response, a TX response, or no action needs to be done by the LIN node.  These bits are writable in LIN mode only." range="15 - 8" rwaccess="R/W"/> 
		<bitfield id="IDBYTE" width="8" begin="7" end="0" resetval="0x0" description="ID byte.This field is effective in LIN mode only. This byte is the LIN mode message ID. On a master node, a write to this register by the CPU initiates a header transmission. For a slave task, this byte is used for message filtering when HGENCTRL [SCIGCR1.12] is '0'. These bits are writable in LIN mode only." range="7 - 0" rwaccess="R/W"/>
	</register>
	<register id="LIN2_LINTD0" acronym="LIN2_LINTD0" offset="0x74" width="32" description="The LINTD0 register contains the lower 4 bytes of the data to be transmitted.[[br]]NOTE: TD&#38;#60;x-1> is equivalent to Data byte &#38;#60;x> of the LIN frame.">
		<bitfield id="TD0" width="8" begin="31" end="24" resetval="0x0" description="8-bit Transmit Buffer 0.Byte 0 to be transmitted is written into this register and then copied to SCITXSHF for transmission. Once byte 0 is written in TDO buffer, transmission will be initiated." range="31 - 24" rwaccess="R/W"/> 
		<bitfield id="TD1" width="8" begin="23" end="16" resetval="0x0" description="8-bit Transmit Buffer 3.Byte 1 to be transmitted is written into this register and then copied to SCITXSHF for transmission." range="23 - 16" rwaccess="R/W"/> 
		<bitfield id="TD2" width="8" begin="15" end="8" resetval="0x0" description="8-bit Transmit Buffer 2.Byte 2 to be transmitted is written into this register and then copied to SCITXSHF for transmission." range="15 - 8" rwaccess="R/W"/> 
		<bitfield id="TD3" width="8" begin="7" end="0" resetval="0x0" description="8-bit Transmit Buffer 3.Byte 3 to be transmitted is written into this register and then copied to SCITXSHF for transmission." range="7 - 0" rwaccess="R/W"/>
	</register>
	<register id="LIN2_LINTD1" acronym="LIN2_LINTD1" offset="0x78" width="32" description="The LINTD1 register contains the upper 4 bytes of the data to be transmitted.[[br]]NOTE: TD&#38;#60;x-1> is equivalent to Data byte &#38;#60;x> of the LIN frame.">
		<bitfield id="TD4" width="8" begin="31" end="24" resetval="0x0" description="8-bit Transmit Buffer 4.Byte4 to be transmitted is written into this register and then copied to SCITXSHF for transmission." range="31 - 24" rwaccess="R/W"/> 
		<bitfield id="TD5" width="8" begin="23" end="16" resetval="0x0" description="8-bit Transmit Buffer 5.Byte 5 to be transmitted is written into this register and then copied to SCITXSHF for transmission. " range="23 - 16" rwaccess="R/W"/> 
		<bitfield id="TD6" width="8" begin="15" end="8" resetval="0x0" description="8-bit Transmit Buffer 6.Byte 6 to be transmitted is written into this register and then copied to SCITXSHF for transmission." range="15 - 8" rwaccess="R/W"/> 
		<bitfield id="TD7" width="8" begin="7" end="0" resetval="0x0" description="8-bit Transmit Buffer 7.Byte 7 to be transmitted is written into this register and then copied to SCITXSHF for transmission." range="7 - 0" rwaccess="R/W"/>
	</register>
